tap 'fluxcd/tap'
tap 'homebrew/services'
tap 'jakehilborn/jakehilborn'
tap 'leoafarias/fvm'
tap 'osx-cross/arm'
tap 'osx-cross/avr'
tap 'tinted-theming/tinted'
tap 'qmk/qmk'

brew 'ack'
brew 'age'
brew 'ansible'
brew 'asdf'
brew 'awscli'
brew 'bash'
brew 'bat'
brew 'certbot'
brew 'chezmoi'
brew 'cocoapods'
brew 'clang-format'
brew 'colima'
brew 'coreutils'
brew 'curl'
brew 'direnv'
brew 'docker'
brew 'docker-buildx'
brew 'docker-compose'
brew 'eza'
brew 'fd'
brew 'fish'
brew 'fisher'
brew 'fvm'
brew 'fluxcd/tap/flux'
brew 'fzf'
brew 'gawk'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'gitleaks'
brew 'go'
brew 'go-task'
brew 'golangci-lint'
brew 'helm'
brew 'htop'
brew 'jq'
brew 'k3d'
brew 'kubectx'
brew 'kubernetes-cli'
brew 'lazygit'
brew 'openjdk@21'
brew 'pgcli'
brew 'python3'
brew 'mactop'
brew 'make'
brew 'mas'
brew 'maven'
brew 'mcfly'
brew 'mercurial'
brew 'minijinja-cli'
brew 'nats-server'
brew 'neovim'
brew 'node'
brew 'npm'
brew 'openssl'
brew 'opentofu'
brew 'postgis'
brew 'postgresql@14', restart_service: :changed
brew 'pre-commit'
brew 'prettier'
brew 'python3'
brew 'qemu'
brew 'qrencode'
brew 'rg'
brew 'ruby'
brew 'sd'
brew 'sops'
brew 'stern'
brew 'sqlfluff'
brew 'sqlite'
brew 'svn'
brew 'talosctl'
brew 'terragrunt'
brew 'tflint'
brew 'tinted-builder-rust'
brew 'tldr'
brew 'hashicorp/tap/vault'
brew 'wireguard-tools'
brew 'yarn'
brew 'yq'
brew 'zsh'

cask_args appdir: '/Applications'
cask '1password'
cask '1password-cli'
cask 'aerial'
cask 'alfred'
cask 'aw-edid-editor'
cask 'balenaetcher'
cask 'betterdisplay'
cask 'ddpm'
cask 'firefox'
cask 'fly'
cask 'font-roboto-mono-nerd-font'
cask 'google-chrome'
cask 'hiddenbar'
cask 'istat-menus'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'maestral'
cask 'microsoft-auto-update'
cask 'microsoft-office'
cask 'monitorcontrol'
cask 'netnewswire'
cask 'omnigraffle'
cask 'parsec'
cask 'qmk-toolbox'
cask 'quicken'
cask 'slack'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'xscope'

mas '1Password for Safari', id: 1569813296
mas 'Hush Nag Blocker', id: 1544743900
mas 'Kagi search for Safari', id: 1622835804
mas 'Keynote', id: 409183694
# mas 'Numbers', id: 409203825
# mas 'Pages', id: 409201541
mas 'Pixelmator Pro', id: 1289583905
# mas 'Testflight', id: 899247664
# mas 'Things', id: 904280696
mas 'Wipr', id: 1320666476
mas 'Xcode', id: 497799835
