tap 'fluxcd/tap'
tap 'homebrew/cask-fonts'
tap 'homebrew/services'
tap 'jakehilborn/jakehilborn'
tap 'osx-cross/arm'
tap 'osx-cross/avr'
tap 'qmk/qmk'

brew 'ack'
brew 'age'
brew 'ansible'
brew 'awscli'
brew 'bash'
brew 'bat'
brew 'chezmoi'
brew 'colima'
brew 'coreutils'
brew 'curl'
brew 'direnv'
brew 'docker'
brew 'docker-buildx'
brew 'docker-compose'
brew 'docker-credential-helper'
brew 'fd'
brew 'fish'
brew 'fisher'
brew 'fluxcd/tap/flux'
brew 'fzf'
brew 'gawk'
brew 'git'
brew 'github'
brew 'git-delta'
brew 'gitleaks'
brew 'go'
brew 'go-task/tap/go-task'
brew 'golangci-lint'
brew 'helm'
brew 'ankitpokhrel/jira-cli/jira-cli'
brew 'jq'
brew 'k3d'
brew 'kubectx'
brew 'kubernetes-cli'
brew 'pgcli'
brew 'python3'
cask 'maestral'
brew 'make'
brew 'mas'
brew 'mcfly'
brew 'mercurial'
brew uninstallbrew 'nats-server'
brew 'neovim'
brew 'node'
brew 'npm'
brew 'openssl'
brew 'postgresql@15', restart_service: :changed
brew 'pre-commit'
brew 'prettier'
brew 'python3'
brew 'qemu'
brew 'qrencode'
brew 'ruby'
brew 'sd'
brew 'sops'
brew 'stern'
brew 'sqlfluff'
brew 'sqlite'
brew 'svn'
brew 'terraform'
brew 'terragrunt'
brew 'tflint'
brew 'tldr'
brew 'hashicorp/tap/vault'
brew 'wireguard-tools'
brew 'yarn'
brew 'yq'
brew 'zsh'

cask_args appdir: '/Applications'
cask '1password'
cask '1password-cli'
cask 'aerial'
cask 'alfred'
cask 'backblaze'
cask 'balenaetcher'
cask 'firefox'
cask 'font-roboto-mono'
cask 'font-roboto-mono-for-powerline'
cask 'fly'
cask 'google-chrome'
cask 'istat-menus'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'microsoft-auto-update'
cask 'microsoft-office'
cask 'monitorcontrol'
cask 'netnewswire'
cask 'obsidian'
cask 'omnigraffle'
cask 'orion'
cask 'parsec'
cask 'qmk-toolbox'
cask 'quicken'
cask 'slack'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'xscope'

mas '1Password for Safari', id: 1569813296
mas 'Hush Nag Blocker', id: 1544743900
mas 'Kagi search for Safari', id: 1622835804
mas 'Keynote', id: 409183694
# mas 'Numbers', id: 409203825
# mas 'Pages', id: 409201541
mas 'Pixelmator Pro', id: 1289583905
# mas 'Testflight', id: 899247664
mas 'Things', id: 904280696
mas 'Wipr', id: 1320666476
# mas 'Xcode', id: 497799835
