tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/services'
tap 'jakehilborn/jakehilborn'
tap 'osx-cross/arm'
tap 'osx-cross/avr'
tap 'qmk/qmk'
tap 'fluxcd/tap'


brew 'ack'
brew 'age'
brew 'antibody'
brew 'awscli'
brew 'bash'
brew 'bat'
brew 'chezmoi'
brew 'coreutils'
brew 'curl'
brew 'direnv'
brew 'fd'
brew 'fish'
brew 'fisher'
brew 'flux'
brew 'fzf'
brew 'gawk'
brew 'git'
brew 'git-delta'
brew 'go'
brew 'golangci-lint'
brew 'helm'
brew 'jq'
brew 'k3d'
brew 'kubectx'
brew 'kubernetes-cli'
brew 'lua@5.1'
brew 'python3'
cask 'maestral'
brew 'make'
brew 'mas'
brew 'mercurial'
brew 'minikube'
brew 'mkcert'
brew 'neovim'
brew 'node'
brew 'npm'
brew 'openssl'
brew 'pandoc'
brew 'postgresql', restart_service: :changed
brew 'prettier'
brew 'python3'
brew 'qrencode'
brew 'qmk'
brew 'ruby'
brew 'sops'
brew 'stow'
brew 'sqlite'
brew 'svn'
brew 'terraform'
brew 'wireguard-tools'
brew 'yarn'
brew 'yq'
brew 'zsh'

cask_args appdir: '/Applications'
cask '1password'
cask '1password-cli'
cask 'aerial'
cask 'alfred'
cask 'backblaze'
cask 'balenaetcher'
cask 'basictex'
cask 'carbon-copy-cloner'
cask 'docker'
cask 'font-cascadia-code'
cask 'font-cascadia-code-pl'
cask 'font-jetbrains-mono'
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'
cask 'fly'
cask 'google-chrome'
cask 'istat-menus'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'logi-options-plus'
cask 'microsoft-office'
cask 'monitorcontrol'
cask 'omnigraffle'
cask 'onyx'
cask 'parsec'
cask 'qmk-toolbox'
cask 'quicken'
cask 'slack'
cask 'the-unarchiver'
cask 'transmit'
cask 'vagrant'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'
cask 'xscope'

mas '1Password for Safari', id: 1569813296
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Pixelmator Pro', id: 1289583905
mas 'Things', id: 904280696
mas 'Wipr', id: 1320666476
mas 'Xcode', id: 497799835